Dlubal.RFEM5.ImposedLineDisplacement
Imposed line displacement parameters.

Dlubal.RFEM5.ImposedLineDisplacement.No
Number

Dlubal.RFEM5.ImposedLineDisplacement.ID
Identifier

Dlubal.RFEM5.ImposedLineDisplacement.Comment
Comment

Dlubal.RFEM5.ImposedLineDisplacement.Tag
Tag

Dlubal.RFEM5.ImposedLineDisplacement.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.ImposedLineDisplacement.LineList
List of lines (supports) on which the displacement is defined.

Dlubal.RFEM5.ImposedLineDisplacement.Start
Imposed displacement at the line start

Dlubal.RFEM5.ImposedLineDisplacement.End
Imposed displacement at the line end